{
  "_ndls": "./gated_deltanet-768-12-117M",
  "architectures": [
    "GatedDeltaNetForCausalLM"
  ],
  "attn": null,
  "attn_mode": "chunk",
  "bos_token_id": 1,
  "conv_size": 4,
  "eos_token_id": 2,
  "expand_v": 1.0,
  "fuse_cross_entropy": true,
  "fuse_norm": true,
  "fuse_swiglu": true,
  "head_dim": 64,
  "hidden_act": "swish",
  "hidden_ratio": 4,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": null,
  "max_position_embeddings": 2048,
  "model_type": "gated_deltanet",
  "norm_eps": 1e-06,
  "num_heads": 12,
  "num_hidden_layers": 12,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.47.1",
  "use_beta": null,
  "use_cache": true,
  "use_gate": true,
  "use_short_conv": true,
  "vocab_size": 32000
}