{
  "_ndls": "./mob_817_token-768-12-128M",
  "architectures": [
    "MobGatedDeltaNetForCausalLM"
  ],
  "attn": null,
  "attn_mode": "chunk",
  "bos_token_id": 1,
  "conv_size": 4,
  "eos_token_id": 2,
  "expand_v": 1,
  "fuse_cross_entropy": true,
  "head_dim": 64,
  "hidden_act": "swish",
  "hidden_ratio": 4,
  "aux_loss_scale": 0,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": null,
  "max_position_embeddings": 2048,
  "model_type": "mob_gated_deltanet",
  "norm_eps": 1e-06,
  "fuse_norm": true,
  "fuse_swiglu": true,
  "num_heads": 12,
  "num_hidden_layers": 12,
  "ratio": 8,
  "shared_head": 1,
  "topk": 7,
  "num_block": 1,
  "overlap": 0,
  "policy": "token",
  "use_layer_wise_balance": true,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.47.1",
  "use_cache": true,
  "use_gate": true,
  "use_short_conv": true,
  "vocab_size": 32000
}